src/test/resources/saveInvoiceRequest

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:gs="http://project-9-karolina-konrad-lukasz-piotr">
  <soapenv:Header/>
  <soapenv:Body>
    <gs:saveInvoiceRequest xmlns:gs="http://project-9-karolina-konrad-lukasz-piotr">
      <gs:invoice>
        <gs:id>null</gs:id>
        <gs:number>1/2019</gs:number>
        <gs:issuedDate>2019-03-01</gs:issuedDate>
        <gs:localDate>2019-03-20</gs:localDate>
        <gs:seller>
          <gs:id>3</gs:id>
          <gs:name>ABC</gs:name>
          <gs:address>aaa</gs:address>
          <gs:taxId>1111</gs:taxId>
          <gs:accountNumber>123123</gs:accountNumber>
          <gs:phoneNumber>00-00</gs:phoneNumber>
          <gs:email>email@ABC.com</gs:email>
        </gs:seller>
        <gs:buyer>
          <gs:id>4</gs:id>
          <gs:name>XYZ</gs:name>
          <gs:address>bbb</gs:address>
          <gs:taxId>2222</gs:taxId>
          <gs:accountNumber>321321</gs:accountNumber>
          <gs:phoneNumber>11-11</gs:phoneNumber>
          <gs:email>email@XYZ.com</gs:email>
        </gs:buyer>
        <gs:entries>
          <gs:invoiceEntry>
            <gs:id>1</gs:id>
            <gs:productName>product1</gs:productName>
            <gs:quantity>5</gs:quantity>
            <gs:unit>szt.</gs:unit>
            <gs:price>20</gs:price>
            <gs:nettValue>100</gs:nettValue>
            <gs:grossValue>100</gs:grossValue>
            <gs:vatRate>VAT_0</gs:vatRate>
          </gs:invoiceEntry>
          <gs:invoiceEntry>
            <gs:id>2</gs:id>
            <gs:productName>product2</gs:productName>
            <gs:quantity>2</gs:quantity>
            <gs:unit>szt.</gs:unit>
            <gs:price>1</gs:price>
            <gs:nettValue>20</gs:nettValue>
            <gs:grossValue>20</gs:grossValue>
            <gs:vatRate>VAT_0</gs:vatRate>
          </gs:invoiceEntry>
        </gs:entries>
      </gs:invoice>
    </gs:saveInvoiceRequest>
  </soapenv:Body>
</soapenv:Envelope>